
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 5 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
* Replace
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;fact&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-05T11:00:30Z" -> (known after apply)
        id                      = "https://fact-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-DATABASE/b9affb0bef8b4967a9b45424d025dc83"
        name                    = "api-POSTGRES-FLEXIBLE-DATABASE"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/fact-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "api PostgreSQL"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-05T11:00:30Z" -> (known after apply)
        id                      = "https://fact-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-HOST/f80de2737ba843c3a6ba07863b279d09"
        name                    = "api-POSTGRES-FLEXIBLE-HOST"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/fact-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "api PostgreSQL"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-05T11:00:30Z" -> (known after apply)
        id                      = "https://fact-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PASS/864840ca27914717b45e0ed922a74946"
        name                    = "api-POSTGRES-FLEXIBLE-PASS"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/fact-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "api PostgreSQL"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-05T11:00:30Z" -> (known after apply)
        id                      = "https://fact-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-PORT/fa7676d2e410404a8ae1240aeecad2e3"
        name                    = "api-POSTGRES-FLEXIBLE-PORT"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/fact-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "api PostgreSQL"
        }
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-05T11:00:30Z" -> (known after apply)
        id                      = "https://fact-aat.vault.azure.net/secrets/api-POSTGRES-FLEXIBLE-USER/813d5a65e320458eb7e49e6f4e451696"
        name                    = "api-POSTGRES-FLEXIBLE-USER"
        tags                    = {
            "application"         = "find-a-court-or-tribunal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/fact-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Find a Court or Tribunal"
            "source"              = "api PostgreSQL"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ administrator_login           = "api_user" -> "fact_user" # forces replacement
      ~ fqdn                          = "fact-api-flexible-postgres-db-v15-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fact-api-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/fact-api-flexible-postgres-db-v15-aat" -> (known after apply)
        name                          = "fact-api-flexible-postgres-db-v15-aat"
      ~ public_network_access_enabled = false -> (known after apply)
      - replication_role              = "" -> null
        tags                          = {
            "application"         = "find-a-court-or-tribunal"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/fact-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#fact-tech"
            "environment"         = "staging"
            "managedBy"           = "Find a Court or Tribunal"
        }
      - zone                          = "1" -> null
        # (12 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "2" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fact-api-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/fact-api-flexible-postgres-db-v15-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fact-api-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/fact-api-flexible-postgres-db-v15-aat" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["fact"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fact-api-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/fact-api-flexible-postgres-db-v15-aat/databases/fact" -> (known after apply)
        name      = "fact"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/fact-api-flexible-postgres-db-v15-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/fact-api-flexible-postgres-db-v15-aat" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 5 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":787,"Program":"tfcmt","SHA1":"","Vars":{}} -->